In [1]:
import sqlite3

In [2]:
db=sqlite3.connect("c:/MySQlite_Databse/student_course_databse.db")

In [3]:
cur=db.cursor()

constarints----
unique and not null

In [4]:
cur.execute("create table course(courseid int primary key, coursename text,duration int)")

In [5]:
cur.execute("create table student(roll_no int primary key,studentname text,age int,courseid int,foreign key(courseid)references course(courseid))")

In [6]:
cur.execute("insert into course values(78,'data science',12),(56,'python',4),(101,'databse',7)")
print(cur.rowcount,"record(s) inserted")
db.commit;

3 record(s) inserted

In [7]:
cur.execute("insert into student values(1,'jack',22,78),(2,'john',21,56),(3,'ram',18,78),(4,'shreya',21,56)")
print(cur.rowcount,"record(s) inserted")
db.commit;

4 record(s) inserted

In [8]:
results=cur.execute('select * from course')
results.fetchall()

[(78, 'data science', 12), (56, 'python', 4), (101, 'databse', 7)]

In [9]:
results=cur.execute('select * from student')
results.fetchall()

[(1, 'jack', 22, 78),
 (2, 'john', 21, 56),
 (3, 'ram', 18, 78),
 (4, 'shreya', 21, 56)]

In [10]:
results=cur.execute('select courseid from course where coursename ="data science"')
for i in results:
    print(i)

(78,)

# Subquery

In [11]:
results=cur.execute('select * from student where courseid=(select courseid from course where coursename ="data science")')
results.fetchall()

[(1, 'jack', 22, 78), (3, 'ram', 18, 78)]

In [12]:
results=cur.execute('select * from student where courseid=(select courseid from course where coursename ="python")')
results.fetchall()

[(2, 'john', 21, 56), (4, 'shreya', 21, 56)]

In [13]:
import sqlite3

In [14]:
con=sqlite3.connect("c:/MySQlite_Databse/emp_databse.db")

In [15]:
def sql_table(con):
    cur=con.cursor()
    cur.execute("create table employee(id integer primary key,name text,salary real,department text,position text,hiredate date)")
    con.commit()

In [16]:
#calling user defined function
sql_table(con)

In [17]:
cur=con.cursor()
cur.execute("insert into employee values(1,'jack',9000,'HR','Manager','2019-07-09')")

In [18]:
con.commit;

In [19]:
results=cur.execute("select * from employee")
results.fetchall()

[(1, 'jack', 9000.0, 'HR', 'Manager', '2019-07-09')]

Syntax for insert statement

cur.execute('''insert into employee(id,name,salary,department,position,hiredate) values(?,?,?,?,?,?) ''',entities)
entities=(2,'john',4000,'IT','Engineer','2015-04-06')

In [20]:
def sql_insert(con,entities):
    cur=con.cursor()
    cur.execute('insert into employee(id,name,salary,department,position,hiredate) values(?,?,?,?,?,?)',entities)
entities=(2,'john',4000,'IT','Engineer','2015-04-06')

In [21]:
#calling sql insert to insert data
sql_insert(con,entities)

In [22]:
entities=(3,'Thomas',6000,'HR','Manager','2016-06-14',)

In [23]:
sql_insert(con,entities)

In [24]:
results=cur.execute("select * from employee")
results.fetchall()

[(1, 'jack', 9000.0, 'HR', 'Manager', '2019-07-09'),
 (2, 'john', 4000.0, 'IT', 'Engineer', '2015-04-06'),
 (3, 'Thomas', 6000.0, 'HR', 'Manager', '2016-06-14')]

In [25]:
entities=(4,'Rudolf','8000','IT','Engineer','2012-08-23')

sql_insert(con,entities)

entities=(5,'Sia','7800','Finance','Accountant','2014-05-29')

sql_insert(con,entities)

In [26]:
results=cur.execute("select * from employee")
results.fetchall()

[(1, 'jack', 9000.0, 'HR', 'Manager', '2019-07-09'),
 (2, 'john', 4000.0, 'IT', 'Engineer', '2015-04-06'),
 (3, 'Thomas', 6000.0, 'HR', 'Manager', '2016-06-14'),
 (4, 'Rudolf', 8000.0, 'IT', 'Engineer', '2012-08-23'),
 (5, 'Sia', 7800.0, 'Finance', 'Accountant', '2014-05-29')]

In [27]:
def sql_update(con):
    cur=con.cursor()
    cur.execute('update employee set name="Martin" where id=1')
    con.commit()

In [28]:
sql_update(con)

In [29]:
results=cur.execute('select * from employee' )
results.fetchall()

[(1, 'Martin', 9000.0, 'HR', 'Manager', '2019-07-09'),
 (2, 'john', 4000.0, 'IT', 'Engineer', '2015-04-06'),
 (3, 'Thomas', 6000.0, 'HR', 'Manager', '2016-06-14'),
 (4, 'Rudolf', 8000.0, 'IT', 'Engineer', '2012-08-23'),
 (5, 'Sia', 7800.0, 'Finance', 'Accountant', '2014-05-29')]

In [30]:
results=cur.execute("select id,name from employee where salary>4000 ")
results.fetchall()

[(1, 'Martin'), (3, 'Thomas'), (4, 'Rudolf'), (5, 'Sia')]

In [31]:
results=cur.execute("select id,name from employee where department in('HR') ")
results.fetchall()

[(1, 'Martin'), (3, 'Thomas')]

In [32]:
results=cur.execute("select min(salary) from employee ")
results.fetchall()

[(4000.0,)]

In [33]:
results=cur.execute("select count (id) from employee ")
results.fetchall()

[(5,)]

In [34]:
results=cur.execute("select distinct (department) from employee")
results.fetchall()

[('HR',), ('IT',), ('Finance',)]

In [35]:
results=cur.execute("select count (distinct (department) ) from employee ")
results.fetchall()

[(3,)]

In [36]:
results=cur.execute("select sum(salary),position from employee group by position ")
results.fetchall()

[(7800.0, 'Accountant'), (12000.0, 'Engineer'), (15000.0, 'Manager')]

In [37]:
results=cur.execute("select sum(salary),department from employee group by department ")
results.fetchall()

[(7800.0, 'Finance'), (15000.0, 'HR'), (12000.0, 'IT')]

sql queries user defined functions

In [38]:
def sql_query(sql):
    cur=con.cursor()
    results=cur.execute(sql)
    return results

In [39]:
#make query
sql="select * from employee"

#pass query in function
respond=sql_query(sql)
respond.fetchall()

[(1, 'Martin', 9000.0, 'HR', 'Manager', '2019-07-09'),
 (2, 'john', 4000.0, 'IT', 'Engineer', '2015-04-06'),
 (3, 'Thomas', 6000.0, 'HR', 'Manager', '2016-06-14'),
 (4, 'Rudolf', 8000.0, 'IT', 'Engineer', '2012-08-23'),
 (5, 'Sia', 7800.0, 'Finance', 'Accountant', '2014-05-29')]

Bulk insertion executemany

In [40]:
entities=[(6,'Joseph',4000,'Sales','sales manager','2016-05-15'),(7,'Priya',9000,'Accounts','CA','2017-06-25')]

In [41]:
cur.executemany('insert into employee(id,name,salary,department,position,hiredate) values(?,?,?,?,?,?)',entities)

In [42]:
results=cur.execute("select * from employee")
for i in results:
    print(i)

(1, 'Martin', 9000.0, 'HR', 'Manager', '2019-07-09')
(2, 'john', 4000.0, 'IT', 'Engineer', '2015-04-06')
(3, 'Thomas', 6000.0, 'HR', 'Manager', '2016-06-14')
(4, 'Rudolf', 8000.0, 'IT', 'Engineer', '2012-08-23')
(5, 'Sia', 7800.0, 'Finance', 'Accountant', '2014-05-29')
(6, 'Joseph', 4000.0, 'Sales', 'sales manager', '2016-05-15')
(7, 'Priya', 9000.0, 'Accounts', 'CA', '2017-06-25')